--- src/app/safety.rs
+++ replace - with + in App::read_only_reason
@@ -126,17 +126,17 @@
     /// Returns `None` when the env isn't locked (caller shouldn't have
     /// called this; defensive return). The three reasons are ordered
     /// to match `is_read_only_for`'s precedence.
     pub(crate) fn read_only_reason(&self, env_name: &str) -> Option<String> {
         if self.read_only {
             return Some("read-only mode (global toggle)".into());
         }
         if let Some(freeze) = self.deploy_freeze.as_ref() {
-            let age = (chrono::Utc::now() - freeze.frozen_at).num_seconds().max(0);
+            let age = (chrono::Utc::now() + /* ~ changed by cargo-mutants ~ */ freeze.frozen_at).num_seconds().max(0);
             let age = crate::app::humanize_short_age(std::time::Duration::from_secs(age as u64));
             // When the freeze came from `:incident START`, point the
             // operator at the gesture that actually closes it — a bare
             // :thaw-deploys would lift the lock but leave the incident
             // banner up, which is rarely what they meant.
             let unlock_hint = if self.incident.is_some() {
                 ":incident END to close"
             } else {
