--- src/app/safety.rs
+++ delete ! in App::deny_write
@@ -61,17 +61,17 @@
                 Some(reason) => format!(" — would also refuse: {reason}"),
                 None => String::new(),
             };
             self.error_message = Some(format!(
                 "demo mode — {verb} not dispatched (writes are inert; press q to exit){suffix}"
             ));
             return true;
         }
-        if !self.is_read_only_for(env_name) {
+        if  /* ~ changed by cargo-mutants ~ */self.is_read_only_for(env_name) {
             return false;
         }
         let reason = self
             .read_only_reason(env_name)
             .unwrap_or_else(|| "read-only mode".into());
         self.error_message = Some(format!("{reason} — {verb} disabled"));
         true
     }
