--- src/app/safety.rs
+++ replace App::deny_write_batch -> bool with true
@@ -89,41 +89,17 @@
     /// probe so those produce their normal whole-fleet message, then
     /// scans for per-env / per-account pins. Mirrors the precedence in
     /// [`App::is_read_only_for`]. `verb` names the op for the toast.
     pub(crate) fn deny_write_batch(&mut self, env_names: &[String], verb: &str) -> bool {
         // Demo mode + global/freeze gates are env-independent: probe
         // with the first env (or "") so the existing single-env path
         // produces the familiar "demo mode …" / "read-only mode …" /
         // "deploys frozen …" toast rather than a per-env list.
-        let probe = env_names.first().map(|s| s.as_str()).unwrap_or("");
-        if self.demo_mode || self.read_only || self.deploy_freeze.is_some() {
-            return self.deny_write(probe, verb);
-        }
-        let locked: Vec<String> = env_names
-            .iter()
-            .filter(|n| self.is_read_only_for(n))
-            .cloned()
-            .collect();
-        if locked.is_empty() {
-            return false;
-        }
-        // Use the first locked env's reason as the headline (per-env
-        // and per-account pins read the same regardless of which env);
-        // list the locked names so the operator knows what to deselect.
-        let reason = self
-            .read_only_reason(&locked[0])
-            .unwrap_or_else(|| "read-only mode".into());
-        self.error_message = Some(format!(
-            "{reason} — {verb} refused: {} of {} selected env(s) locked ({})",
-            locked.len(),
-            env_names.len(),
-            locked.join(", ")
-        ));
-        true
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Human-readable explanation of *why* an env is read-only, used
     /// in the toast / footer when a destructive action is blocked.
     /// Returns `None` when the env isn't locked (caller shouldn't have
     /// called this; defensive return). The three reasons are ordered
     /// to match `is_read_only_for`'s precedence.
     pub(crate) fn read_only_reason(&self, env_name: &str) -> Option<String> {
