--- src/app/safety.rs
+++ replace || with && in App::deny_write_batch
@@ -90,17 +90,17 @@
     /// scans for per-env / per-account pins. Mirrors the precedence in
     /// [`App::is_read_only_for`]. `verb` names the op for the toast.
     pub(crate) fn deny_write_batch(&mut self, env_names: &[String], verb: &str) -> bool {
         // Demo mode + global/freeze gates are env-independent: probe
         // with the first env (or "") so the existing single-env path
         // produces the familiar "demo mode …" / "read-only mode …" /
         // "deploys frozen …" toast rather than a per-env list.
         let probe = env_names.first().map(|s| s.as_str()).unwrap_or("");
-        if self.demo_mode || self.read_only || self.deploy_freeze.is_some() {
+        if self.demo_mode || self.read_only && /* ~ changed by cargo-mutants ~ */ self.deploy_freeze.is_some() {
             return self.deny_write(probe, verb);
         }
         let locked: Vec<String> = env_names
             .iter()
             .filter(|n| self.is_read_only_for(n))
             .cloned()
             .collect();
         if locked.is_empty() {
