--- src/app/action_flow.rs
+++ replace App::handle_action_key with ()
@@ -122,222 +122,17 @@
         if self.detail.is_some() {
             self.mode = Mode::Detail;
         } else {
             self.mode = Mode::Normal;
         }
     }
 
     pub(crate) fn handle_action_key(&mut self, key: KeyEvent) {
-        let Some(flow) = self.action_flow.as_mut() else {
-            self.mode = Mode::Normal;
-            return;
-        };
-        match flow {
-            ActionFlow::Menu { list_state } => match key.code {
-                // Menu has j/k cursor + Enter to pick — no text input, so
-                // `q` as close is unambiguous and matches every other
-                // overlay's pattern.
-                KeyCode::Esc | KeyCode::Char('q') => self.close_action_flow(),
-                KeyCode::Char('j') | KeyCode::Down => {
-                    let cur = list_state.selected().unwrap_or(0);
-                    let next = (cur + 1) % ACTIONS.len();
-                    list_state.select(Some(next));
-                }
-                KeyCode::Char('k') | KeyCode::Up => {
-                    let cur = list_state.selected().unwrap_or(0);
-                    let next = (cur + ACTIONS.len() - 1) % ACTIONS.len();
-                    list_state.select(Some(next));
-                }
-                KeyCode::Enter => {
-                    let Some(idx) = list_state.selected() else {
-                        return;
-                    };
-                    let action = ACTIONS[idx];
-                    self.advance_action_flow(action);
-                }
-                _ => {}
-            },
-            ActionFlow::SwapTarget { picker, .. } => match key.code {
-                KeyCode::Esc => self.close_action_flow(),
-                KeyCode::Down | KeyCode::Char('j')
-                    if !key.modifiers.contains(KeyModifiers::CONTROL) =>
-                {
-                    picker.move_selection(1);
-                }
-                KeyCode::Up | KeyCode::Char('k')
-                    if !key.modifiers.contains(KeyModifiers::CONTROL) =>
-                {
-                    picker.move_selection(-1);
-                }
-                KeyCode::Enter => {
-                    let Some(target) = picker.selected_value() else {
-                        return;
-                    };
-                    let source = match flow {
-                        ActionFlow::SwapTarget { source, .. } => source.clone(),
-                        _ => return,
-                    };
-                    // A CNAME swap rewrites BOTH environments' DNS, so
-                    // it is a write to the target as much as to the
-                    // source. The only `deny_write` on this path is in
-                    // `open_action_menu`, against the *selected* env —
-                    // and the target is picked afterwards, from this
-                    // list. So `safety.envs.TARGET.read_only` did not
-                    // protect an env from having production traffic
-                    // swapped onto or off it; you just had to select the
-                    // other env first. Gate the target here, where it is
-                    // first known.
-                    if self.deny_swap_target(&ParameterisedAction {
-                        swap_with: Some(target.clone()),
-                        ..Default::default()
-                    }) {
-                        self.close_action_flow();
-                        return;
-                    }
-                    let warning = self
-                        .environments
-                        .iter()
-                        .find(|e| e.name == source)
-                        .map(compute_traffic_warning)
-                        .unwrap_or(None);
-                    self.action_flow = Some(ActionFlow::Confirm(ConfirmModal {
-                        params: ParameterisedAction {
-                            swap_with: Some(target),
-                            ..Default::default()
-                        },
-                        action: Action::SwapCnames,
-                        target_env: source,
-                        typed: TextInput::new(),
-                        kind: ConfirmKind::YesNo,
-                        dryrun: None,
-                        loading_dryrun: false,
-                        recent_events: None,
-                        loading_events: false,
-                        traffic_warning: warning,
-                        version_preview: None,
-                        loading_version_preview: false,
-                        health_check_probe: None,
-                        loading_health_check: false,
-                        unavailability_line: None,
-                        loading_unavailability: false,
-                        lint_issues: None,
-                        loading_lint: false,
-                    }));
-                }
-                // TextInput consumes editing keys (incl. Backspace);
-                // reselect a still-matching row after any accepted edit.
-                _ => {
-                    if picker.filter.handle_key(key) {
-                        let filt = picker.filtered();
-                        if !filt
-                            .iter()
-                            .any(|i| Some(*i) == picker.list_state.selected())
-                        {
-                            picker.list_state.select(filt.first().copied());
-                        }
-                    }
-                }
-            },
-            ActionFlow::Confirm(modal) => match (key.code, modal.kind) {
-                (KeyCode::Esc, _) => self.close_action_flow(),
-                // `q` cancels Y/N confirms (n / esc are the others). TypeName
-                // confirms intentionally don't bind q since the user is
-                // typing the env name and `q` might be part of it.
-                (KeyCode::Char('q'), ConfirmKind::YesNo) => self.close_action_flow(),
-                (KeyCode::Char('y'), ConfirmKind::YesNo) | (KeyCode::Enter, ConfirmKind::YesNo) => {
-                    // Queue with a 5s cancel window instead of dispatching
-                    // immediately. The action flow closes (modal gone)
-                    // and a countdown lands in `status_message`; `U` in
-                    // Normal mode undoes it before the deadline.
-                    let m = modal.clone();
-                    self.close_action_flow();
-                    self.queue_action_dispatch(m);
-                }
-                (KeyCode::Char('n'), ConfirmKind::YesNo) => self.close_action_flow(),
-                (KeyCode::Enter, ConfirmKind::TypeName)
-                    if modal.typed.text() == modal.target_env.as_str() =>
-                {
-                    // Same cancel-window treatment as Y-confirms. Terminate
-                    // is the loudest example — the typed-name guard already
-                    // prevents accidental dispatch, but the 5s window is a
-                    // last-ditch "oh god no" rescue.
-                    let m = modal.clone();
-                    self.close_action_flow();
-                    self.queue_action_dispatch(m);
-                }
-                // TextInput consumes editing keys for the type-to-confirm
-                // field (cursor move / Ctrl-W included).
-                (_, ConfirmKind::TypeName) => {
-                    modal.typed.handle_key(key);
-                }
-                _ => {}
-            },
-            ActionFlow::Rollout(flow) => match (key.code, &flow.state) {
-                // Esc / q close the rollout at any state — even
-                // during Dispatching the operator can abort
-                // further regions. The dispatched ones have
-                // already fired (each region's UpdateEnvironment
-                // is a non-reversible AWS write), but the loop
-                // halts so regions queued behind the current
-                // one don't fire.
-                (KeyCode::Esc, _) | (KeyCode::Char('q'), _) => self.close_action_flow(),
-                // `y` confirms a fully-pre-flighted plan. Only
-                // valid in AwaitingConfirm. Switches state to
-                // Dispatching and fires the first region.
-                (KeyCode::Char('y'), crate::mode_action::RolloutState::AwaitingConfirm)
-                | (KeyCode::Enter, crate::mode_action::RolloutState::AwaitingConfirm) => {
-                    // Refuse to dispatch if no regions passed
-                    // pre-flight — there's nothing safe to send.
-                    let any_ok = flow.regions.iter().any(|r| r.env_found == Some(true));
-                    if !any_ok {
-                        self.error_message = Some(
-                            "rollout: no regions passed pre-flight — fix or `esc` to abort".into(),
-                        );
-                        return;
-                    }
-                    // Find the first region that passed pre-
-                    // flight. Failed regions are skipped (their
-                    // outcome stays None — surfaced as
-                    // "skipped" in the final report).
-                    let Some((first_idx, _)) = flow
-                        .regions
-                        .iter()
-                        .enumerate()
-                        .find(|(_, r)| r.env_found == Some(true))
-                    else {
-                        return;
-                    };
-                    flow.state = crate::mode_action::RolloutState::Dispatching {
-                        next_index: first_idx,
-                    };
-                    let region = flow.regions[first_idx].region.clone();
-                    let env_name = flow.env_name.clone();
-                    let version_label = flow.version_label.clone();
-                    let wait_for_green_secs = flow.wait_for_green_secs;
-                    let rollout_id = flow.rollout_id.clone();
-                    let profile = self.context.profile.clone();
-                    self.spawn_rollout_dispatch(
-                        rollout_id,
-                        profile,
-                        region,
-                        env_name,
-                        version_label,
-                        wait_for_green_secs,
-                    );
-                }
-                // `n` aborts before any dispatch fires. Same as
-                // esc but matches the y/n posture of the
-                // standard ConfirmModal.
-                (KeyCode::Char('n'), crate::mode_action::RolloutState::AwaitingConfirm) => {
-                    self.close_action_flow();
-                }
-                _ => {}
-            },
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn advance_action_flow(&mut self, action: Action) {
         let Some(env) = self.target_env_for_action() else {
             self.close_action_flow();
             return;
         };
         match action {
