--- src/app/action_flow.rs
+++ delete field swap_with from struct ParameterisedAction expression in App::handle_action_key
@@ -196,17 +196,17 @@
                     let warning = self
                         .environments
                         .iter()
                         .find(|e| e.name == source)
                         .map(compute_traffic_warning)
                         .unwrap_or(None);
                     self.action_flow = Some(ActionFlow::Confirm(ConfirmModal {
                         params: ParameterisedAction {
-                            swap_with: Some(target),
+                             /* ~ changed by cargo-mutants ~ */
                             ..Default::default()
                         },
                         action: Action::SwapCnames,
                         target_env: source,
                         typed: TextInput::new(),
                         kind: ConfirmKind::YesNo,
                         dryrun: None,
                         loading_dryrun: false,
