--- src/app/action_flow.rs
+++ replace App::advance_action_flow with ()
@@ -331,168 +331,17 @@
                     self.close_action_flow();
                 }
                 _ => {}
             },
         }
     }
 
     pub(crate) fn advance_action_flow(&mut self, action: Action) {
-        let Some(env) = self.target_env_for_action() else {
-            self.close_action_flow();
-            return;
-        };
-        match action {
-            Action::SwapCnames => {
-                // Build a list of envs in the same application (excluding the source).
-                let candidates: Vec<String> = self
-                    .environments
-                    .iter()
-                    .filter(|e| e.application == env.application && e.name != env.name)
-                    .map(|e| e.name.clone())
-                    .collect();
-                if candidates.is_empty() {
-                    self.action_flow = None;
-                    self.mode = if self.detail.is_some() {
-                        Mode::Detail
-                    } else {
-                        Mode::Normal
-                    };
-                    self.error_message = Some(format!(
-                        "no swap candidates: app '{}' has only one env",
-                        env.application
-                    ));
-                    return;
-                }
-                let picker = Picker::new(PickerKind::Region, candidates, None); // kind unused here
-                self.action_flow = Some(ActionFlow::SwapTarget {
-                    source: env.name.clone(),
-                    picker,
-                });
-            }
-            Action::Terminate => {
-                // Terminate is the only Action that uses TypeName confirm;
-                // every other entry routes through `open_parameterised_action`.
-                // Preflight gating still flows from `Action::wants_preflight()`
-                // so the rule lives in exactly one place.
-                let wants_preflight = action.wants_preflight();
-                self.action_flow = Some(ActionFlow::Confirm(ConfirmModal {
-                    params: ParameterisedAction::default(),
-                    action,
-                    target_env: env.name.clone(),
-                    typed: TextInput::new(),
-                    kind: ConfirmKind::TypeName,
-                    dryrun: None,
-                    loading_dryrun: wants_preflight,
-                    recent_events: None,
-                    loading_events: wants_preflight,
-                    traffic_warning: compute_traffic_warning(&env),
-                    version_preview: None,
-                    loading_version_preview: false,
-                    health_check_probe: None,
-                    loading_health_check: false,
-                    unavailability_line: None,
-                    loading_unavailability: false,
-                    lint_issues: None,
-                    loading_lint: false,
-                }));
-                if wants_preflight {
-                    self.spawn_dry_run(env.name.clone());
-                    self.spawn_preflight_events(env.name.clone());
-                }
-            }
-            Action::Rebuild => {
-                self.open_parameterised_action(action, ParameterisedAction::default());
-            }
-            // Parameterised actions need user input before the confirm can
-            // be built. The menu closes itself and pre-fills the command
-            // bar so the user types `<arg>` and Enter, which routes through
-            // the existing `:deploy` / `:upgrade` / `:clone` / `:scale`
-            // handlers (all of which open a confirm modal).
-            Action::Deploy => {
-                self.close_action_flow();
-                self.mode = Mode::Command;
-                self.command_input = "deploy ".into();
-                self.status_message = Some("type a version label and press enter".into());
-            }
-            Action::UpgradePlatform => {
-                self.close_action_flow();
-                self.spawn_list_compatible_platforms(env.name.clone());
-                self.mode = Mode::Command;
-                self.command_input = "upgrade ".into();
-                self.status_message =
-                    Some("listing platforms in overlay; paste an ARN and press enter".into());
-            }
-            Action::Clone => {
-                self.close_action_flow();
-                self.mode = Mode::Command;
-                self.command_input = "clone ".into();
-                self.status_message = Some("type a new env name and press enter".into());
-            }
-            Action::Scale => {
-                self.close_action_flow();
-                self.mode = Mode::Command;
-                self.command_input = "scale ".into();
-                self.status_message = Some(
-                    "scale N (instances), or `scale min N` / `scale max N`; enter to apply".into(),
-                );
-            }
-            Action::Capacity => {
-                // `:capacity` opens a modal form pre-filled from
-                // DescribeConfigurationSettings — no command-bar args
-                // needed, so we close the menu and dispatch straight
-                // to the form opener.
-                self.close_action_flow();
-                self.cmd_capacity();
-            }
-            Action::AbortUpdate => {
-                self.action_flow = Some(ActionFlow::Confirm(ConfirmModal {
-                    params: ParameterisedAction::default(),
-                    action,
-                    target_env: env.name.clone(),
-                    typed: TextInput::new(),
-                    kind: ConfirmKind::YesNo,
-                    dryrun: None,
-                    loading_dryrun: false,
-                    recent_events: None,
-                    loading_events: false,
-                    traffic_warning: compute_traffic_warning(&env),
-                    version_preview: None,
-                    loading_version_preview: false,
-                    health_check_probe: None,
-                    loading_health_check: false,
-                    unavailability_line: None,
-                    loading_unavailability: false,
-                    lint_issues: None,
-                    loading_lint: false,
-                }));
-            }
-            _ => {
-                self.action_flow = Some(ActionFlow::Confirm(ConfirmModal {
-                    params: ParameterisedAction::default(),
-                    action,
-                    target_env: env.name.clone(),
-                    typed: TextInput::new(),
-                    kind: ConfirmKind::YesNo,
-                    dryrun: None,
-                    loading_dryrun: false,
-                    recent_events: None,
-                    loading_events: false,
-                    traffic_warning: compute_traffic_warning(&env),
-                    version_preview: None,
-                    loading_version_preview: false,
-                    health_check_probe: None,
-                    loading_health_check: false,
-                    unavailability_line: None,
-                    loading_unavailability: false,
-                    lint_issues: None,
-                    loading_lint: false,
-                }));
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Add a row to the pending-actions panel before dispatching. Callers
     /// follow with a `tokio::spawn` that sends an `AppMsg::ActionResult`;
     /// the result handler finds the first matching unfinished row and
     /// stamps it with the outcome. Caps the list at `PENDING_CAP`.
     pub(crate) fn push_pending(&mut self, label: impl Into<String>, target: impl Into<String>) {
         if self.pending_actions.len() >= PENDING_CAP {
