--- src/app/action_flow.rs
+++ replace App::deny_swap_target -> bool with true
@@ -546,20 +546,17 @@
     /// The target arrives later, from a picker or a command argument, and
     /// nothing looked at it. So `safety.envs.TARGET.read_only` could be
     /// defeated by selecting the other env first.
     ///
     /// One helper, called from both swap entry points, so the two cannot
     /// drift. Pinned by `a_read_only_env_cannot_be_swapped_into` and
     /// `swap_cnames_command_also_gates_the_target`.
     pub(crate) fn deny_swap_target(&mut self, params: &ParameterisedAction) -> bool {
-        match params.swap_with.as_deref() {
-            Some(target) => self.deny_write(target, "swap-cnames target"),
-            None => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn open_parameterised_action(
         &mut self,
         action: Action,
         params: ParameterisedAction,
     ) {
         let Some(env) = self.selected_env().cloned() else {
