--- src/app/action_flow.rs
+++ replace App::open_parameterised_action_on with ()
@@ -577,122 +577,17 @@
     /// the table cursor. The `selected_env()`-based wrapper is the
     /// common path; this is the cursor-independent escape hatch.
     pub(crate) fn open_parameterised_action_on(
         &mut self,
         env: crate::aws::Environment,
         action: Action,
         params: ParameterisedAction,
     ) {
-        if self.deny_write(&env.name, action.label()) {
-            return;
-        }
-        // A swap also writes to its target; see `deny_swap_target`.
-        if self.deny_swap_target(&params) {
-            return;
-        }
-        // The preflight (impact preview + last-3 events) is gated by
-        // `Action::wants_preflight()` — single source of truth, see
-        // `mode_action.rs`. Every ConfirmModal construction site must
-        // route through here so the rule can't drift.
-        let wants_preflight = action.wants_preflight();
-        // For Deploy with a candidate label, pull the version
-        // metadata (label / age / description) and inline the
-        // existing `:deploy --preview` body in the modal. Saves
-        // the operator the separate `:deploy LABEL --preview`
-        // round-trip.
-        let wants_version_preview = action == Action::Deploy && params.deploy_version.is_some();
-        // Taken before `params` moves into the modal below. Cloning one
-        // field is cheaper than keeping eleven copies alive to avoid it.
-        let preview_label = params.deploy_version.clone();
-        let modal = ConfirmModal {
-            // The whole point of the consolidation: one move, not eleven
-            // copies. Adding a parameterised field is now one edit.
-            params,
-            action,
-            target_env: env.name.clone(),
-            typed: TextInput::new(),
-            kind: ConfirmKind::YesNo,
-            dryrun: None,
-            loading_dryrun: wants_preflight,
-            recent_events: None,
-            loading_events: wants_preflight,
-            // Skip traffic_warning for SsmRun — operators frequently
-            // run diagnostic shells on Red envs (it's how they diagnose
-            // Red), so showing "env is currently Red" in the modal
-            // would suggest they shouldn't dispatch the very command
-            // they're using to investigate. Other write actions get
-            // the warning because Red+write is genuinely risky.
-            // (0.17.4 review)
-            traffic_warning: if action == Action::SsmRun {
-                None
-            } else {
-                compute_traffic_warning(&env)
-            },
-            version_preview: None,
-            loading_version_preview: wants_version_preview,
-            health_check_probe: None,
-            // Pre-deploy health-check probe only runs for Deploy
-            // confirms — we want to warn the operator if the env's
-            // current health-check-url is dead BEFORE they ship a
-            // new build over it. For non-Deploy actions, the probe
-            // is meaningless. Skipped in `--demo` mode because the
-            // synthetic CNAMEs would always fail DNS and pollute
-            // screencasts with a fake-warning red herring.
-            loading_health_check: wants_version_preview && !env.cname.is_empty() && !self.demo_mode,
-            unavailability_line: None,
-            // Same gate as the health-check probe — only useful for
-            // Deploy confirms; --demo mode skips the AWS call.
-            loading_unavailability: wants_version_preview && !self.demo_mode,
-            lint_issues: None,
-            // Lint at confirm time runs against every confirm modal,
-            // not just Deploy. The health-check probe + unavailability
-            // pill specialise on deploys; lint is universal — operator
-            // sees AllAtOnce / health-check-empty / cooldown-low etc.
-            // before confirming any destructive action. Skipped in
-            // demo mode (same gate as the other probes — no AWS
-            // round-trip in demo).
-            //
-            // SsmRun also skips lint — running an ad-hoc shell command
-            // isn't gated by EB-config-health rules; firing them here
-            // would be noise.
-            loading_lint: !self.demo_mode && action != Action::SsmRun,
-        };
-        let needs_health_check_probe = modal.loading_health_check;
-        let needs_unavailability = modal.loading_unavailability;
-        let needs_lint = modal.loading_lint;
-        self.action_flow = Some(ActionFlow::Confirm(modal));
-        self.mode = Mode::Action;
-        if wants_preflight {
-            self.spawn_dry_run(env.name.clone());
-            self.spawn_preflight_events(env.name.clone());
-        }
-        if wants_version_preview {
-            if let Some(label) = preview_label {
-                self.spawn_version_preview(
-                    env.application.clone(),
-                    env.name.clone(),
-                    env.version_label.clone(),
-                    label,
-                );
-            }
-        }
-        if needs_health_check_probe {
-            self.spawn_health_check_probe(
-                env.application.clone(),
-                env.name.clone(),
-                env.cname.clone(),
-            );
-        }
-        if needs_unavailability {
-            self.spawn_unavailability_estimate(env.application.clone(), env.name.clone());
-        }
-        if needs_lint {
-            self.spawn_confirm_lint(env.clone());
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Fetch `list_compatible_platforms` for `env` and surface them in an
     /// overlay so the user can copy the desired ARN into `:upgrade <arn>`.
     pub(crate) fn spawn_list_compatible_platforms(&mut self, env_name: String) {
         let client = self.client_for_env(&env_name);
         let tx = self.msg_tx.clone();
         let gen = self.generation;
