--- src/app/action_flow.rs
+++ replace App::spawn_action with ()
@@ -909,227 +909,11 @@
 
     pub(crate) fn spawn_action(&mut self, modal: ConfirmModal) {
         // `--demo` mode runs against a synthetic fleet on a fake
         // AwsClient. Destructive dispatch against that client would
         // fail at the SDK layer but still write `stage=dispatched`
         // audit lines to the real audit log. Refuse outright so a
         // fat-fingered keypress during a demo / screencast doesn't
         // touch operator state.
-        if self.demo_mode {
-            self.error_message = Some(format!(
-                "demo mode — {} not dispatched (writes are inert; press q to exit)",
-                modal.action.label()
-            ));
-            return;
-        }
-        // Per-env / per-account read-only locks short-circuit the
-        // dispatch before any AWS call. `read_only_reason` returns
-        // the specific cause (global toggle vs. config-pinned env vs.
-        // pinned account) so the toast tells the operator exactly
-        // which knob is keeping them safe.
-        if self.is_read_only_for(&modal.target_env) {
-            let reason = self
-                .read_only_reason(&modal.target_env)
-                .unwrap_or_else(|| "read-only mode".into());
-            self.error_message = Some(format!("{reason} — {} disabled", modal.action.label()));
-            return;
-        }
-        // For Deploy actions: snapshot the env's pre-deploy version
-        // label before dispatching, so :rollback-deploy and the
-        // optional `--auto-rollback Nm` watchdog know what to roll
-        // back TO. Skip if we don't have the env in our cached
-        // fleet (e.g. assume-role race where the modal opened
-        // before the refresh landed) — the existing :rollback can
-        // scan events as a fallback.
-        if modal.action == Action::Deploy {
-            if let Some(env) = self
-                .environments
-                .iter()
-                .find(|e| e.name == modal.target_env)
-            {
-                if !env.version_label.is_empty() {
-                    self.deploy_snapshots.insert(
-                        env.name.clone(),
-                        DeploySnapshot {
-                            env_name: env.name.clone(),
-                            previous_version_label: env.version_label.clone(),
-                            taken_at: chrono::Utc::now(),
-                        },
-                    );
-                }
-            }
-            // Arm the auto-rollback watchdog if requested. Two signals
-            // can fire: the env reaching Green on the next refresh
-            // tick (early disarm via apply_refresh — most common
-            // outcome) or the deadline timer firing AutoRollbackCheck.
-            // `armed_watchdogs` carries the in-flight state for both
-            // surfaces.
-            if let Some(secs) = modal.params.auto_rollback_secs {
-                let tx = self.msg_tx.clone();
-                let env_name = modal.target_env.clone();
-                let gen = self.generation;
-                // Snapshot the rollback target now so the watchdog
-                // doesn't have to re-look it up later. The pre-deploy
-                // snapshot we just inserted is the source of truth.
-                let target_label = self
-                    .deploy_snapshots
-                    .get(&modal.target_env)
-                    .map(|s| s.previous_version_label.clone())
-                    .unwrap_or_default();
-                let armed_at = chrono::Utc::now();
-                let deadline_at = armed_at + chrono::Duration::seconds(secs as i64);
-                self.armed_watchdogs.insert(
-                    modal.target_env.clone(),
-                    ArmedWatchdog {
-                        env_name: modal.target_env.clone(),
-                        target_label,
-                        armed_at,
-                        deadline_at,
-                    },
-                );
-                self.status_message = Some(format!(
-                    "auto-rollback armed: {secs}s to reach Green or revert"
-                ));
-                tokio::spawn(async move {
-                    tokio::time::sleep(std::time::Duration::from_secs(secs)).await;
-                    let _ = tx.send(AppMsg::AutoRollbackCheck { gen, env_name });
-                });
-            }
-            // Arm the wait-for-green tracker if requested. Pure
-            // observability — `apply_refresh` watches `watching_deploys`
-            // and pins the outcome (success on Green, error on timeout).
-            // No tokio task needed: apply_refresh runs on every refresh
-            // tick anyway and checks deadlines there. Orthogonal to
-            // auto-rollback so both flags can coexist.
-            if let Some(secs) = modal.params.wait_for_green_secs {
-                let target_label = modal.params.deploy_version.clone().unwrap_or_default();
-                let armed_at = chrono::Utc::now();
-                let deadline_at = armed_at + chrono::Duration::seconds(secs as i64);
-                self.watching_deploys.insert(
-                    modal.target_env.clone(),
-                    WatchingDeploy {
-                        env_name: modal.target_env.clone(),
-                        target_label,
-                        armed_at,
-                        deadline_at,
-                    },
-                );
-                // Don't clobber a "auto-rollback armed" message if
-                // both flags were set — append instead.
-                if let Some(existing) = self.status_message.as_mut() {
-                    existing.push_str(&format!("; watching for Green ({secs}s)"));
-                } else {
-                    self.status_message = Some(format!(
-                        "watching deploy: {secs}s to reach Green or report timeout"
-                    ));
-                }
-            }
-        }
-        // SsmRun's dispatch shape doesn't fit the standard
-        // `Result<(), _>` + `ActionResult` pipeline below — the SDK
-        // call returns per-instance rows that surface in a
-        // TextOverlay. Short-circuit to a dedicated helper that
-        // carries the audit / pending / spawn dance with the right
-        // payload. Everything ABOVE this point (read-only check, demo
-        // guard, deploy-only auto-rollback / wait-for-green arming —
-        // none of which fires for SsmRun) still runs uniformly.
-        if modal.action == Action::SsmRun {
-            let command = modal.params.ssm_run_command.clone().unwrap_or_default();
-            let instances = modal.params.ssm_run_instances.clone().unwrap_or_default();
-            self.spawn_ssm_run_impl(modal.target_env.clone(), command, instances);
-            return;
-        }
-        // The ROW's region, not the home one. Under a multi-region
-        // fan-out `self.aws` points wherever the operator started, so a
-        // restart / terminate / deploy on a row from another region
-        // either failed as "environment not found" or — with a
-        // same-named env at home, which is exactly what a fleet with
-        // per-region copies has — dispatched a destructive action
-        // against the wrong environment. The audit line takes the same
-        // region so the journal names where the write actually went.
-        let region = self.region_for_name(&modal.target_env);
-        let client = self.client_for_region(&region);
-        let tx = self.msg_tx.clone();
-        let gen = self.generation;
-        let action = modal.action;
-        let env = modal.target_env.clone();
-        let swap_with = modal.params.swap_with.clone();
-        let deploy_version = modal.params.deploy_version.clone();
-        let upgrade_arn = modal.params.upgrade_platform_arn.clone();
-        let clone_target = modal.params.clone_target.clone();
-        let scale_min = modal.params.scale_min;
-        let scale_max = modal.params.scale_max;
-        write_audit_entry(
-            self.context.account_id.as_deref(),
-            self.context.profile.as_deref(),
-            &region,
-            action,
-            &env,
-            swap_with.as_deref(),
-        );
-        self.push_pending(action.label(), env.clone());
-        tokio::spawn(async move {
-            let aws = match client.resolve().await {
-                Ok(aws) => aws,
-                Err(e) => {
-                    let _ = tx.send(AppMsg::ActionResult {
-                        gen,
-                        action,
-                        env_name: env,
-                        result: Err(flatten_err("cached_client", e)),
-                    });
-                    return;
-                }
-            };
-            let result = match action {
-                Action::Rebuild => aws.rebuild_env(&env).await,
-                Action::RestartAppServer => aws.restart_app_server(&env).await,
-                Action::Terminate => aws.terminate_env(&env).await,
-                Action::SwapCnames => match swap_with {
-                    Some(dest) => aws.swap_cnames(&env, &dest).await,
-                    None => Err(color_eyre::eyre::eyre!("swap target missing")),
-                },
-                Action::Deploy => match deploy_version {
-                    Some(ver) => aws.deploy_version(&env, &ver).await,
-                    None => Err(color_eyre::eyre::eyre!("deploy version missing")),
-                },
-                Action::UpgradePlatform => match upgrade_arn {
-                    Some(arn) => aws.upgrade_platform(&env, &arn).await,
-                    None => Err(color_eyre::eyre::eyre!("upgrade platform ARN missing")),
-                },
-                Action::Clone => match clone_target {
-                    Some(target) => aws.clone_env(&env, &target).await,
-                    None => Err(color_eyre::eyre::eyre!("clone target name missing")),
-                },
-                Action::Scale => match (scale_min, scale_max) {
-                    (Some(mn), Some(mx)) => aws.scale_env(&env, mn, mx).await,
-                    _ => Err(color_eyre::eyre::eyre!("scale min/max missing")),
-                },
-                Action::AbortUpdate => aws.abort_environment_update(&env).await,
-                // Capacity opens a modal form (cmd_capacity) and dispatches
-                // via spawn_option_settings_update — it never reaches
-                // spawn_action's ConfirmModal path. Same for Config* and
-                // TerminateInstance which have dedicated spawn paths.
-                // SsmRun is short-circuited above via spawn_ssm_run_impl
-                // and never reaches this match — included here for
-                // exhaustiveness with a defensive error in case the
-                // short-circuit is ever removed.
-                Action::Capacity
-                | Action::ConfigSave
-                | Action::ConfigDelete
-                | Action::ConfigApply
-                | Action::TerminateInstance
-                | Action::SsmRun => Err(color_eyre::eyre::eyre!(
-                    "internal: {} dispatched through spawn_action path",
-                    action.label()
-                )),
-            }
-            .map_err(|e| flatten_err("action", e));
-            let _ = tx.send(AppMsg::ActionResult {
-                gen,
-                action,
-                env_name: env,
-                result,
-            });
-        });
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
