--- src/cli/mod.rs
+++ replace write_refusal -> Option<String> with Some("xyzzy".into())
@@ -101,26 +101,17 @@
 pub(crate) fn write_refusal(
     safety_cfg: &crate::config::Config,
     env: &str,
     profile: &Option<String>,
     active_freeze: Option<crate::freeze::FreezeMarker>,
 ) -> Option<String> {
     // Cross-process freeze (the pid-scoped marker a live TUI session
     // persists for :freeze-deploys / :incident).
-    if let Some(m) = active_freeze {
-        return Some(crate::freeze::refusal_message(&m));
-    }
-    let pin_profile = profile
-        .clone()
-        .or_else(|| std::env::var("AWS_PROFILE").ok());
-    if let Some(pin) = safety_cfg.pin_reason(env, pin_profile.as_deref()) {
-        return Some(format!("refusing {env} — pinned by {pin}"));
-    }
-    None
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// CLI wrapper over [`write_refusal`]: read the world, print, exit 3.
 ///
 /// `subject` is what the message names — usually the env, but
 /// `audit replay` says "restart on api-prod", which is more useful and
 /// worth keeping.
 pub(crate) fn refuse_write(prog: &str, subject: &str, env: &str, profile: Option<&str>) {
