--- src/cli/mod.rs
+++ replace refuse_write with ()
@@ -119,32 +119,17 @@
 }
 
 /// CLI wrapper over [`write_refusal`]: read the world, print, exit 3.
 ///
 /// `subject` is what the message names — usually the env, but
 /// `audit replay` says "restart on api-prod", which is more useful and
 /// worth keeping.
 pub(crate) fn refuse_write(prog: &str, subject: &str, env: &str, profile: Option<&str>) {
-    let profile = profile.map(str::to_string);
-    if let Some(reason) = write_refusal(
-        &crate::config::load(),
-        env,
-        &profile,
-        crate::freeze::read_active(),
-    ) {
-        // `write_refusal` phrases the pin case as "refusing ENV — …";
-        // for a caller naming something richer, say that instead.
-        let reason = reason
-            .strip_prefix(&format!("refusing {env} — "))
-            .map(|r| format!("refusing {subject} — {r}"))
-            .unwrap_or(reason);
-        eprintln!("{prog}: {reason}");
-        std::process::exit(3);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Shared value-flag guard: reject a missing value or a following
 /// flag consumed as one. Class fix from the 0.26 max-review — a
 /// swallowed value silently changed semantics (`lint --fix --yes
 /// --env` widened to the whole fleet; `--rules --json` disabled a CI
 /// gate and ate the JSON flag).
 pub(crate) fn take_value<'a, I: Iterator<Item = &'a String>>(
