--- src/cli/mod.rs
+++ replace take_value -> Result<String, String> with Ok("xyzzy".into())
@@ -148,23 +148,17 @@
 /// --env` widened to the whole fleet; `--rules --json` disabled a CI
 /// gate and ate the JSON flag).
 pub(crate) fn take_value<'a, I: Iterator<Item = &'a String>>(
     iter: &mut I,
     prog: &str,
     flag: &str,
     what: &str,
 ) -> Result<String, String> {
-    let Some(v) = iter.next() else {
-        return Err(format!("{prog}: {flag} expects {what}"));
-    };
-    if v.starts_with("--") {
-        return Err(format!("{prog}: {flag} expects {what}, got flag '{v}'"));
-    }
-    Ok(v.clone())
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Exit a CLI command after draining in-flight audit-webhook POSTs —
 /// `std::process::exit` (and returning from `#[tokio::main]`) cancels
 /// spawned tasks, so a fire-and-forget outcome POST written just
 /// before exit usually never left the machine. No-op when nothing is
 /// in flight; bounded at slightly over the POST timeout.
 pub(crate) async fn exit_after_drain(code: i32) -> ! {
