--- src/cli/mod.rs
+++ replace refuse_if_frozen with ()
@@ -72,20 +72,17 @@
 
 /// Cross-process freeze gate for CLI write paths (0.28): refuse when
 /// a live TUI session holds `:freeze-deploys` / `:incident START`
 /// (pid-scoped marker — see `crate::freeze`). Exit 3, same class as
 /// the pin refusal. These paths had the same blind spot the MCP
 /// write tools would have had: a fleet frozen mid-incident could
 /// still be written from a second terminal.
 pub(crate) fn refuse_if_frozen(prog: &str) {
-    if let Some(m) = crate::freeze::read_active() {
-        eprintln!("{prog}: refusing — {}", crate::freeze::refusal_message(&m));
-        std::process::exit(3);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// The write gate: freeze first, then the config pin. Returns the
 /// refusal message when the write must not proceed, `None` when clear.
 ///
 /// This began life inside the MCP server, which had the right shape
 /// already — a verdict over data passed in, "so the gate stays pure +
 /// hermetically testable" — while the three other CLI write paths each
