--- src/freeze.rs
+++ replace read_active -> Option<FreezeMarker> with None
@@ -98,17 +98,17 @@
         marker.pid
     )
 }
 
 /// The active freeze, if any: marker exists AND its owning pid is
 /// alive. A dead-pid marker is stale (crashed TUI) — ignored and
 /// removed so it can't confuse later readers.
 pub(crate) fn read_active() -> Option<FreezeMarker> {
-    read_active_with(&marker_path(), pid_alive)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Testable core: liveness probe injected.
 fn read_active_with(path: &Path, alive: impl Fn(u32) -> bool) -> Option<FreezeMarker> {
     let m = parse_file(path)?;
     if alive(m.pid) {
         return Some(m);
     }
