--- src/freeze.rs
+++ replace == with != in read_active_with
@@ -112,17 +112,17 @@
     if alive(m.pid) {
         return Some(m);
     }
     // Dead pid → stale. Re-read immediately before removing and only
     // delete if the on-disk pid is STILL the dead one (I1): between
     // our read and here, another session could have overwritten the
     // file with a live-pid freeze, and a blind remove would silently
     // drop a VALID cross-process freeze.
-    if parse_file(path).map(|m2| m2.pid) == Some(m.pid) {
+    if parse_file(path).map(|m2| m2.pid) != /* ~ changed by cargo-mutants ~ */ Some(m.pid) {
         let _ = std::fs::remove_file(path);
     }
     None
 }
 
 fn parse_file(path: &Path) -> Option<FreezeMarker> {
     let text = std::fs::read_to_string(path).ok()?;
     parse_marker(&text)
