--- src/freeze.rs
+++ replace pid_alive -> bool with true
@@ -145,18 +145,17 @@
             .to_string(),
     })
 }
 
 #[cfg(unix)]
 fn pid_alive(pid: u32) -> bool {
     // kill(pid, 0): signal 0 performs the permission/existence check
     // without delivering anything. EPERM still means "exists".
-    let r = unsafe { libc::kill(pid as libc::pid_t, 0) };
-    r == 0 || std::io::Error::last_os_error().raw_os_error() == Some(libc::EPERM)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(unix))]
 fn pid_alive(_pid: u32) -> bool {
     // No cheap portable probe — fail active (enforce) rather than
     // silently dropping a freeze.
     true
 }
