--- src/freeze.rs
+++ replace pid_alive -> bool with false
@@ -153,17 +153,17 @@
     let r = unsafe { libc::kill(pid as libc::pid_t, 0) };
     r == 0 || std::io::Error::last_os_error().raw_os_error() == Some(libc::EPERM)
 }
 
 #[cfg(not(unix))]
 fn pid_alive(_pid: u32) -> bool {
     // No cheap portable probe — fail active (enforce) rather than
     // silently dropping a freeze.
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn tmp(name: &str) -> PathBuf {
         std::env::temp_dir().join(format!("ebman-freeze-{}-{name}.json", std::process::id()))
