--- src/freeze.rs
+++ replace FreezeMarker::remedy -> &'static str with ""
@@ -23,21 +23,17 @@
     /// `:incident END`); false for a plain `:freeze-deploys`.
     pub incident: bool,
     pub at: String,
 }
 
 impl FreezeMarker {
     /// The operator-facing remedy string for a refusal message.
     pub(crate) fn remedy(&self) -> &'static str {
-        if self.incident {
-            ":incident END"
-        } else {
-            ":thaw-deploys"
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn marker_path() -> PathBuf {
     crate::util::cache_dir().join("freeze.json")
 }
 
 /// Write (or overwrite) the marker for this process. Returns `Err`
