--- src/freeze.rs
+++ replace marker_path -> PathBuf with Default::default()
@@ -32,17 +32,17 @@
             ":incident END"
         } else {
             ":thaw-deploys"
         }
     }
 }
 
 fn marker_path() -> PathBuf {
-    crate::util::cache_dir().join("freeze.json")
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Write (or overwrite) the marker for this process. Returns `Err`
 /// when persistence failed — the caller MUST surface that, because a
 /// silently-absent marker fails OPEN (agent + CLI writes are NOT
 /// blocked) while the operator believes the fleet is frozen.
 pub(crate) fn write_marker(reason: &str, incident: bool) -> std::io::Result<()> {
     write_marker_at(&marker_path(), std::process::id(), reason, incident)
