--- src/freeze.rs
+++ replace write_marker -> std::io::Result<()> with Ok(())
@@ -40,17 +40,17 @@
     crate::util::cache_dir().join("freeze.json")
 }
 
 /// Write (or overwrite) the marker for this process. Returns `Err`
 /// when persistence failed — the caller MUST surface that, because a
 /// silently-absent marker fails OPEN (agent + CLI writes are NOT
 /// blocked) while the operator believes the fleet is frozen.
 pub(crate) fn write_marker(reason: &str, incident: bool) -> std::io::Result<()> {
-    write_marker_at(&marker_path(), std::process::id(), reason, incident)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn write_marker_at(path: &Path, pid: u32, reason: &str, incident: bool) -> std::io::Result<()> {
     let body = format!(
         "{{\"pid\":{pid},\"reason\":{},\"incident\":{incident},\"at\":{}}}\n",
         crate::util::json_string(reason),
         crate::util::json_string(&chrono::Utc::now().to_rfc3339()),
     );
