--- src/freeze.rs
+++ replace clear_marker_if_own with ()
@@ -64,17 +64,17 @@
         return Err(e);
     }
     Ok(())
 }
 
 /// Remove the marker, but only if THIS process owns it — a thaw in
 /// one TUI session must not silently clear another session's freeze.
 pub fn clear_marker_if_own() {
-    clear_if_pid_at(&marker_path(), std::process::id());
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn clear_if_pid_at(path: &Path, own_pid: u32) {
     if let Some(m) = parse_file(path) {
         if m.pid == own_pid {
             let _ = std::fs::remove_file(path);
         }
     }
