--- src/freeze.rs
+++ replace refusal_message -> String with String::new()
@@ -82,26 +82,17 @@
 
 /// The one refusal sentence for an active fleet freeze.
 ///
 /// Shared because it was written twice — once in `cli::refuse_if_frozen`
 /// and once in the MCP write gate — with the same body and different
 /// framing, so the two surfaces disagreed in wording about the same
 /// condition and either could drift on the next edit.
 pub(crate) fn refusal_message(marker: &FreezeMarker) -> String {
-    let reason = if marker.reason.is_empty() {
-        "no reason given"
-    } else {
-        marker.reason.as_str()
-    };
-    format!(
-        "fleet freeze active ({reason}) — lift with `{}` in the owning TUI (pid {})",
-        marker.remedy(),
-        marker.pid
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The active freeze, if any: marker exists AND its owning pid is
 /// alive. A dead-pid marker is stale (crashed TUI) — ignored and
 /// removed so it can't confuse later readers.
 pub(crate) fn read_active() -> Option<FreezeMarker> {
     read_active_with(&marker_path(), pid_alive)
 }
